{"config": [{"config": {"bias_regularizer": null, "strides": [1, 1], "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 1, 28, 28], "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dtype": "float32", "filters": 32, "use_bias": true, "kernel_regularizer": null, "activation": "relu", "name": "conv2d_1", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"bias_regularizer": null, "strides": [1, 1], "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "filters": 32, "use_bias": true, "kernel_regularizer": null, "activation": "relu", "name": "conv2d_2", "kernel_size": [3, 3], "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "data_format": "channels_first", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "seed": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1", "data_format": "channels_first"}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "relu", "name": "dense_1", "units": 128, "kernel_constraint": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_2", "seed": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "softmax", "name": "dense_2", "units": 10, "kernel_constraint": null, "bias_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2"}