{"config": [{"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "dilation_rate": [1, 1], "batch_input_shape": [null, 1, 28, 28], "strides": [1, 1], "data_format": "channels_first", "dtype": "float32", "padding": "valid", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "name": "conv2d_2", "bias_constraint": null, "activity_regularizer": null, "filters": 32, "trainable": true, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_first", "padding": "valid", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "name": "conv2d_3", "bias_constraint": null, "activity_regularizer": null, "filters": 32, "trainable": true, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_first", "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "seed": null, "trainable": true, "name": "dropout_1", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"data_format": "channels_first", "trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "name": "dense_1", "units": 128, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"rate": 0.5, "seed": null, "trainable": true, "name": "dropout_2", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "softmax", "name": "dense_2", "units": 10, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}], "keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential"}