{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.2", "config": [{"class_name": "Conv2D", "config": {"activation": "relu", "data_format": "channels_first", "activity_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "filters": 32, "trainable": true, "bias_constraint": null, "batch_input_shape": [null, 1, 28, 28], "name": "conv2d_14", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "config": {"activation": "relu", "data_format": "channels_first", "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "filters": 32, "trainable": true, "bias_constraint": null, "name": "conv2d_15", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_first", "name": "max_pooling2d_4", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "name": "dropout_7", "seed": null, "trainable": true}}, {"class_name": "Flatten", "config": {"data_format": "channels_first", "name": "flatten_4", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "relu", "activity_regularizer": null, "units": 128, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "bias_constraint": null, "name": "dense_7", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "name": "dropout_8", "seed": null, "trainable": true}}, {"class_name": "Dense", "config": {"activation": "softmax", "activity_regularizer": null, "units": 10, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "bias_constraint": null, "name": "dense_8", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}]}